base/InformationRegisters/бит_ВалютныеНеденежныеСтатьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ВалютныеНеденежныеСтатьи</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаМУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Comment>Регистр бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/InformationRegisters/бит_ВалютныеНеденежныеСтатьи/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ЗначенияЗаполнения.Свойство("ОбъектСистемы", фОбъектСистемыИзСписка);
	
	Если Параметры.Ключ.Пустой()
		И Не Значениезаполнено(Параметры.ЗначениеКопирования) Тогда
		
		Если ЗначениеЗаполнено(фОбъектСистемыИзСписка) Тогда
			Запись.ОбъектСистемы = фОбъектСистемыИзСписка;
		Иначе
			// Для новой записи заполним объект системы из настроек пользователя.
			ПолучаемаяНастройка  = ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойРегистрБухгалтерииУУ;
			Запись.ОбъектСистемы = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ПолучаемаяНастройка);
		КонецЕсли;
		
		// Приведем тип значения счета.
		ПривестиТипЗначенияСчета();
		
	КонецЕсли;
	
	// Заполним значения реквизитов формы.
	МетаРегБухБюджетирование = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование;	
	фРегБухБюджетирование    = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегБухБюджетирование);
	
	Если бит_ОбщегоНазначения.ЕстьОбъектыМСФО() Тогда
		МетаРегБухМеждународный = Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2;
		фРегБухМеждународный    = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегБухМеждународный);
	КонецЕсли;
	
	// Сформируем список регистров бухгалтерии для выбора.
	ВидОбъектаРегБух = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии;
	
	фСписокРегистров = бит_УправленческийУчет.СформироватьСписокОбъектовДляВыбора(ВидОбъектаРегБух, "бит_Дополнительный");
	фСписокРегистров.Добавить(фРегБухБюджетирование,Метаданные.РегистрыБухгалтерии.бит_Бюджетирование.Представление(),,
		БиблиотекаКартинок.РегистрБухгалтерии);
	
	// Отсортируем список регистров для выбора.
	фСписокРегистров.СортироватьПоПредставлению();
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
	УстановитьПараметрыВыбораДляСчетов();

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Если это открытие существующей записи, тогда.
	Если Не Параметры.Ключ.Пустой() И Не ЗначениеЗаполнено(фОбъектСистемыИзСписка) Тогда
		
		Если ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("ТаблицаФормы") 
			И ЭтотОбъект.ВладелецФормы.Родитель.фФормаСпискаОткрытаСОтбором Тогда
			Элементы.ОбъектСистемы.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	ИзменениеОбъектСистемыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбъектСистемыНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, фСписокРегистров, Элемент, фСписокРегистров.НайтиПоЗначению(Запись.ОбъектСистемы));
	
КонецПроцедуры

// Процедура - завершение обработчика события "НачалоВыбора" поля ввода "ОбъектСистемы".
// 
&НаКлиенте
Процедура ОбъектСистемыНачалоВыбораЗавершение(ВыбранноеЗначение, Парамтры)Экспорт
	
   Если ВыбранноеЗначение <> Неопределено Тогда
		
		Запись.ОбъектСистемы = ВыбранноеЗначение.Значение;
		ИзменениеОбъектСистемыСервер();
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура осуществляет управление доступностью/видимостью элементов формы.
// 
&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ОбъектСистемы.Видимость = Не ЗначениеЗаполнено(фОбъектСистемыИзСписка);
	
	ОбъектСистемы = Запись.ОбъектСистемы;
	
	Элементы.Счет.ТолькоПросмотр = Не ЗначениеЗаполнено(ОбъектСистемы);
	
	// Управление видимостью флагов настройки ресурсов.
	Элементы.СуммаСценарий.Видимость = ОбъектСистемы = фРегБухБюджетирование;
	Если бит_ОбщегоНазначения.ЕстьОбъектыМСФО() Тогда
		Элементы.СуммаМУ.Видимость = ОбъектСистемы = фРегБухМеждународный;	
	КонецЕсли;                                                                                    	
	
КонецПроцедуры // УправлениеЭлементамиФормы()

// Процедура устанвливает параметры выбора для элементов формы. 
// 
// Параметры:
//  Массив.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.Счет);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

// Процедура обрабатывает изменение объекта системы.
// 
&НаСервере
Процедура ИзменениеОбъектСистемыСервер()
	
	Если Запись.СуммаСценарий И Не Запись.ОбъектСистемы = фРегБухБюджетирование Тогда
		Запись.СуммаСценарий = Ложь;
	КонецЕсли;
	
	Если бит_ОбщегоНазначения.ЕстьОбъектыМСФО() Тогда
		Если Запись.СуммаМУ И Не Запись.ОбъектСистемы = фРегБухМеждународный Тогда
			Запись.СуммаМУ = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Приведем тип значения счета.
	ПривестиТипЗначенияСчета();
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ИзменениеОбъектСистемыСервер()

// Процедура приводит тип значения счета к типу плана счетов выбранного регистра бухгалтерии.
// 
&НаСервере
Процедура ПривестиТипЗначенияСчета()
	
	Если Не ЗначениеЗаполнено(Запись.ОбъектСистемы) Тогда
		Запись.Счет = Неопределено;
	Иначе
		
		// Получим пустую ссылку плана счетов выбранного регистра бухгалтерии.
		ИмяРегБух 	     = Запись.ОбъектСистемы.ИмяОбъекта;
		ИмяПланаСчетов   = Метаданные.РегистрыБухгалтерии[ИмяРегБух].ПланСчетов.Имя;
		СчетПустаяСсылка = ПланыСчетов[ИмяПланаСчетов].ПустаяСсылка();
		
		Если Запись.Счет = Неопределено Тогда
			Запись.Счет = СчетПустаяСсылка;
		Иначе
			
			Если Не ТипЗнч(Запись.Счет) = ТипЗнч(СчетПустаяСсылка) Тогда
				
				// Найдем счет по коду ранее выбранного счета.
				СчетДляЗамены = ПланыСчетов[ИмяПланаСчетов].НайтиПоКоду(Запись.Счет.Код);
				
				Если ЗначениеЗаполнено(СчетДляЗамены) Тогда
					Запись.Счет = СчетДляЗамены;
				Иначе
					Запись.Счет = СчетПустаяСсылка;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; // Если Не ЗначениеЗаполнено(ОбъектСистемы) Тогда.
	
КонецПроцедуры // ПривестиТипЗначенияСчета()

#КонецОбласти
